tap "homebrew/bundle"

brew "bat"
brew "php"
brew "composer"
brew "coreutils"
brew "ctop"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "go-task"
brew "imagemagick"
brew "ios-deploy"
brew "make"
brew "mkcert"
brew "neovim"
brew "pkgconf"
brew "powerlevel10k"
brew "ruby-build"
brew "rbenv"
brew "stow"
brew "unzip"
brew "wget"
brew "yq"