tap "homebrew/bundle"
tap "symfony-cli/tap"

cask_args appdir: "~/Applications", require_sha: true

## Formulae

# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Freely available high-quality data compressor
brew "bzip2"
# Library for command-line editing
brew "readline"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Command-line tool for DigitalOcean
brew "doctl"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Conversion library
brew "libiconv", link: true
# X.509 and CMS library
brew "libksba"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Manage compile and link flags for libraries
brew "pkg-config"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Symfony CLI helps Symfony developers manage projects, from local code to remote infrastructure
brew "symfony-cli/tap/symfony-cli"

## Casks

# Universal database tool and SQL client
cask "dbeaver-community"
# Web browser
cask "firefox@developer-edition"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
# Team communication and collaboration software
cask "slack"
# Spotify and iTunes in the menu bar
cask "spotmenu"
# Open-source code editor
cask "visual-studio-code"
# OpenJDK distribution from Azul
cask "zulu@17"
