tap "homebrew/bundle"
tap "koekeishiya/formulae"

brew "ansible"
brew "bat"
brew "php"
brew "composer"
brew "coreutils"
brew "ctop"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "go-task"
brew "imagemagick"
brew "ios-deploy"
brew "make"
brew "mkcert"
brew "mysql-client"
brew "neovim"
brew "pkgconf"
brew "powerlevel10k"
brew "pyenv"
brew "python-setuptools"
brew "ruby-build"
brew "rbenv"
brew "stow"
brew "unzip"
brew "watchman"
brew "wget"
brew "yq"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "1password-cli", args: { appdir: "~/Applications" }
cask "font-hack-nerd-font"
cask "ngrok", args: { appdir: "~/Applications" }
cask "orbstack", args: { appdir: "~/Applications" }
cask "slack", args: { appdir: "~/Applications" }
cask "visual-studio-code", args: { appdir: "~/Applications" }
cask "zulu@17", args: { appdir: "~/Applications" }

vscode "arcanis.vscode-zipfs"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql-syntax"
vscode "junstyle.php-cs-fixer"
vscode "ms-azuretools.vscode-docker"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sanderronde.phpstan-vscode"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "swmansion.react-native-ide"
