tap "homebrew/bundle"
tap "symfony-cli/tap"
brew "autoconf"
brew "automake"
brew "oniguruma"
brew "bat"
brew "bzip2"
brew "libzip"
brew "readline"
brew "php"
brew "composer"
brew "coreutils"
brew "ctop"
brew "gh"
brew "git-filter-repo"
brew "go-task"
brew "hadolint"
brew "libiconv", link: true
brew "libksba"
brew "libxml2"
brew "libyaml"
brew "mkcert"
brew "openssl@1.1"
brew "pkg-config"
brew "powerlevel10k"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "stow"
brew "tree"
brew "vapor"
brew "zlib"
brew "symfony-cli/tap/symfony-cli"
cask "firefox@developer-edition"
cask "ngrok"
cask "orbstack", args: { appdir: "~/Applications" }
cask "slack", args: { appdir: "~/Applications" }
cask "visual-studio-code", args: { appdir: "~/Applications" }
cask "zulu@17", args: { appdir: "~/Applications" }
vscode "alexkrechik.cucumberautocomplete"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql-syntax"
vscode "matthewpi.caddyfile-support"
vscode "mblode.twig-language-2"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "xdebug.php-debug"
