tap "nikitabobko/tap"

brew "gh"
brew "git"
brew "go-task"
brew "make"
brew "mkcert"
brew "openssl"
brew "php"
brew "stow"

cask_args appdir: "~/Applications", require_sha: true

cask "font-hack-nerd-font"
cask "nikitabobko/tap/aerospace"
cask "orbstack"
cask "slack"
cask "visual-studio-code"
cask "iterm2"
cask "font-fira-code-nerd-font"
brew "lazygit"
brew "neovim"
brew "tree-sitter-cli"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "wget"
brew "ctop"
cask "firefox@developer-edition"
brew "nvm"
brew "golang"
cask "battery"
brew "mariadb"
